class Food {
  final String name;
  final int calories;
  final String image;
  final String detail;
  bool isSelected; // New property to track selection

  Food({required this.name, required this.calories, required this.image, required this.detail, this.isSelected = false});
}

final List<Food> myallFoods = [
  Food(name: '1 Slice of Pizza', calories: 300, image: "assets/images/pizza.jpg", detail: 'ซูเปอร์โบวล์ การแข่งขันชิงแชมป์อเมริกันฟุตบอลสุดยิ่งใหญ่ วันนี้เป็นวันที่พิซซ่าถูกสั่งเดลิเวอรี่มากที่สุด! อาจจะเท่ากับหรือมากกว่าน่องไก่ทอดด้วยซ้ำ!'),
  Food(name: 'Burger', calories: 500, image: "assets/images/Burger.jpg", detail: 'เบอร์เกอร์ที่ใหญ่ที่สุดที่เคยมีมาหนักกว่า 907 กิโลกรัม, ชาวเยอรมันช่วยกันชิงสถิติโลกนี้มาได้ในปี ค.ศ.2012'),
  Food(name: '5 pieces of Sushi', calories: 400, image: "assets/images/Sushi.jpg", detail: 'ในศตรวรรษที่ 8 ซูชิเคยมีค่ามากๆ จนผู้คนใช้เป็นตราเงินตราทองแลกเปลี่ยนสินค้าด้วย! ไม่ธรรมดา!'),
  Food(name: '300 grams of Pasta', calories: 450, image: "assets/images/Pasta.jpg", detail: 'จีนส่งออกพาสต้าเยอะที่สุดในโลก รองลงมาคืออิตาลีและสหรัฐตามอันดับ'),
  Food(name: 'Bowl of Salad', calories: 150, image: "assets/images/Salad.jpg", detail: 'จริงๆแล้ว ซีซ่าร์สลัดถูกตั้งชื่อมาจากนายซีซ่าร์ คาร์ดีนี เชฟจากอิตาลี ไม่ใช่จากกษัตริย์โรมันนะ'),
  Food(name: 'Tacos', calories: 450, image: "assets/images/Tacos.webp", detail: 'ไม่มีใครทราบแน่ชัดว่าแท้จริงแล้วทาโก้นั้นมีแหล่งกำเนิดมาจากที่ใด แต่ Aztec, Mayan และ Latin America เป็นผู้ต้องสงสัย (เก่าแก่ทั้งนั้น)'),
  Food(name: 'Ice Cream Cone', calories: 250, image: "assets/images/Ice Cream.jpg", detail: 'Blue Laws ของสหรัฐในสมัยก่อนห้ามขายแอลกอฮอลในวันอาทิตย์ ผู้คนจึงเริ่มหันมาขายวิปครีมเย็นๆกัน(ไอศกรีม) ไปๆมาๆคนก็เรียกมันว่า Sundae เพราะขายวันอาทิตย์'),
  Food(name: 'Steak', calories: 600, image: "assets/images/Steak.jpg", detail: 'วัวตัวหนึ่ง ทั่วๆไปแล้วจะแบ่งได้เป็นสเต็กถึง 40% เลยทีเดียว'),
  Food(name: 'Chicken Rice', calories: 450, image:"assets/images/Chicken Rice.jpg", detail: 'มีให้รับประทานกันทั่วทุกภาคในประเทศไทย นอกจากนี้ยังนิยมรับประทานกันมากในมาเลเซียและสิงคโปร์อีกด้วย[2][3][4] และยังติดอันดับเป็นหนึ่งใน 15 เมนูอาหารต่างชาติที่ชาวญี่ปุ่นชื่นชอบอีก'),
  Food(name: 'Soup', calories: 200, image: "assets/images/Soup.jpg", detail: 'นักเขียนชาวสกอตแลนด์ เอียน ครอฟตัน (Ian Crofton) ได้ระบุไว้ว่า เมนูซุปที่เชื่อว่ามีความเก่าแก่มากที่สุด เท่าที่มนุษย์รู้จักนั้น ก็คือซุปที่ทำมาจากเนื้อของฮิปโปโปเตมัส'),
  Food(name: 'Chicken Krapow with Fried Egg', calories: 450, image: "assets/images/Krapow.jpg", detail: 'ใบกะเพรายังเชื่อว่ามีความสามารถในการกระตุ้นความจำ และช่วยลดระดับความเครียดได้ในบางครั้ง'),
  Food(name: 'Shrimp Fried Rice',calories: 530,image: 'assets/images/ข้าวผัดกุ้งใส่ไข่.jpg',detail: 'ข้าวผัด เกิดขึ้นครั้งแรกในประเทศจีน ซึ่งเกิดจากการนำเอาข้าวเย็นเหลือข้ามคืนผัดรวมกับส่วนผสมอื่นๆ จนทำให้เกิดเป็นอาหารเมนูใหม่ขึ้นมาจากนั้นข้าวผัดก็แพร่หลายไปพร้อมๆกับชาวจีน '),
  Food(name: 'Pad Kana Moo Grob',calories: 520,image: 'assets/images/ข้าวผัดคะน้าหมูกรอบ.jpg',detail: 'หากใช้วิธีการทำที่ไม่ใช้น้ำมันมากนัก และใช้หมูที่ไม่มีไขมันเยอะมาก ผัดคะน้าหมูกรอบก็สามารถเป็นอาหารที่มีประโยชน์ต่อสุขภาพได้ด้วย'),
  Food(name: 'Rad Nah with Pork',calories: 400,image: 'assets/images/ราดหน้าหมู.jpg',detail: 'ราดหน้ายุคแรกจะห่อใบตองขาย ใส่ผักกวางตุ้งและหน่อไม้ ราดน้ำราดแต่น้อย ต่อมาจึงมีการปรับรูปแบบไปต่าง ๆ กัน ราดหน้าที่แพร่หลายในไทยนั้น มีที่มาจากราดหน้าของจีน'),
  Food(name: 'Mee Grob Radd Nah',calories: 690,image: 'assets/images/บะหมี่กรอบราดหน้า.jpg',detail: 'หมี่กรอบ เป็นอาหารที่รู้จักกันมานานร่วมศตวรรษ เป็นได้ทั้งกับข้าว และเครื่องเคียงเป็นอาหารลูกผสมระหว่างไทยและจีน ซึ่งสังเกตได้จากเครื่องปรุง และวิธีทำ'),
  Food(name: 'Pad Thai',calories: 710,image: 'assets/images/ผัดไทห่อไข่.jpg',detail: 'ผัดไทยได้กลายเป็นที่รู้จักของคนต่างชาติในสมัยจอมพล ป. พิบูลสงคราม นายกรัฐมนตรีในขณะนั้นซึ่งเป็นช่วงเดียวกับสงครามโลกครั้งที่ 2 เนื่องจากในช่วงนั้นสภาวะเศรษฐกิจของประเทศตกต่ำ'),
  Food(name: 'Chicken Biryani',calories: 540,image: 'assets/images/ข้าวหมกไก่.webp',detail: 'เป็นเอกลักษณ์อย่างหนึ่งในตะวันออกกลาง รวมทั้งชาวมุสลิมในประเทศต่างๆ ต้นกำเนิดของข้าวหมกมาจากอินเดียซึ่งรับวัฒนธรรมการปรุงข้าวหมกไปจากเปอร์เซียได้พัฒนามาเป็น บิรยานี'),
  Food(name: 'Pork Leg Rice',calories: 690,image: 'assets/images/ข้าวขาหมู.jpg',detail: 'โดยแรกเริ่มเดิมทีเมนูนี้เกิดขึ้นในล้งกั่ง ซึ่งเป็นอำเภอเล็กๆในเก๊กเอี๊ย โดยเริ่มขายและกินกันแพร่หลายมาตั้งแต่ในสมัยราชวงศ์ถัง คือเป็นเมนูโบราณที่ยังคงอยู่ยืนยงได้มาถึงทุกวันนี้ ถือว่าเป็นการพิสูจน์ได้อย่างนึงล่ะฮะว่าอร่อยจริง ถูกปากคนหลายยุคหลายสมัย'),
  Food(name: 'Rice mixed with Krapi',calories: 610,image: 'assets/images/ช้าวคลุกกะปิ.webp',detail: 'นสมัยพระนารายณ์มหาราชช่วงที่ประกาศใช้นโยบายเปิดประเทศ ได้มีมิตรสหายต่างชาติเข้ามากรุงศรีอยุธยา มีทูตจากเปอร์เซียเข้ามาเยือน และบันทึกถึงกะปิไว้ว่า กะปิเป็นเครื่องปรุงอาหารอย่างหนึ่งของไทย เป็นของเน่า กลิ่นเหม็น ไม่เห็นสมควรนำไปปรุงอาหารได้เลย'),
  Food(name: 'Pad See-Iw',calories: 680,image: 'assets/images/ผัดซีอิ้ว.jpg',detail: 'ผัดซีอิ๊ว เป็นผัดที่ได้รับอิทธิพลมาจากประเทศจีน จะเหมือนอาหารประเภทก๋วยเตี๋ยว อีกทั้งยังเป็นทีรู้จักกันอย่างมากไม่ว่าจะเป็นคนไทย และนักท่องเที่ยวชาวต่างชาติ เพราะอาหารดังที่กล่าวมานี้นั้น เป็นที่นิยมในร้านอาหารทั่วไปในประเทศไทย'),
  Food(name: 'Fried Clam',calories: 650,image: 'assets/images/หอยทอด.jpg',detail: 'มาจากประเทศจีนแล้วนำมาปรับเปลี่ยนให้เข้ากับความชอบของคนไทย หอยทอดที่ทำขายในแต่ละท้องถิ่นจะมีเอกลักษณ์เป็นของตนเอง'),
  Food(name: 'American Fried Rice',calories: 700,image: 'assets/images/ข้าวผัดอเมริกัน.jpg',detail: 'หลักฐานประวัติของข้าวผัดอเมริกันก็ยืนยันได้ว่า เมนูนี้เกิดขึ้นจากความคิดและฝีมือของคนไทย ไม่มีส่วนเกี่ยวข้องกับประเทศอเมริกันเลย'),
];